{
  "name": "Munyatam Bhardwaj",
  "contact": "munyatam2001@gmail.com | (+91) 7027114881 | LinkedIn",
  "summary": "munyatam2001@gmail.com | (+91) 7027114881 LinkedIn (open to opportunities across India & international)",
  "experience_raw": [
    "AI-driven solutions ● Currently working as Staff Sales Consultant (IC2) at Oracle, designing and implementing large-scale cloud Oracle India Pvt. Ltd. Cloud Solution Engineer Sept 2022 - Present (3 years) Cloud Solution Engineer (IC1) → Cloud Solution Engineer (IC2) (Promoted June 2025) ●"
  ],
  "projects_raw": [
    "DBMS, Operation Insights. Building end-to-end data pipelines and monitoring solutions for enterprise customers ● Outstanding performer with Employee of the Quarter recognition, promoted to IC2 within 2 years, and recognized as SME in Observability & Management domain across JAPAC region ● Previously worked as Data Engineer Intern at Wiley Edge, and as Consultant at Morgan Stanley Fusion Application logs, serving as SME for observability domain across India, JAPAC, and NA regions ● Engineered fusion application logs ingestion pipeline - designed end-to-end solution sending audit logs from Fusion Apps to OCI Logging → SIEM tools/Logging Analytics for comprehensive analysis with custom dashboards for security insights ● Reduced manual monitoring effort and enabled real-time security threat detection for enterprise customers. ● Developed integration between Logging Analytics service and VBCS for ISV customers, enabling seamless log analytics capabilities within custom applications ● Streamlined ISV onboarding process reducing integration time from 2 weeks to 3 days ● Built MySQL Audit Logs to OCI Logging Analytics pipeline via Object Storage with automated log masking using OCI Functions for data security compliance ● Created OCI Logging Analytics Usage Reporting Script with compartment-wise analysis, enabling cost optimization and resource management across tenancies ○ Cost monitoring solution adopted across Oracle internal teams and widely reused by customers ● Developed comprehensive Object Storage monitoring dashboard - built end-to-end monitoring solution tracking complete Object Storage activity with custom Functions integration for automated notifications on bulk uploads ○ Created advanced analytics capabilities using custom Logging Analytics queries to provide insights on storage utilization by user, file type distribution (images, PDFs, etc.), and usage patterns ○ Enhanced operational visibility enabling proactive storage management and cost optimization for enterprise customers ● Delivered centralized audit and compliance monitoring solution for Oracle Fusion Applications with automated alerting and custom dashboards Improved compliance reporting and reduced audit preparation time significantly ● ● Contributed 6 Knowledge Management assets - 2 reused widely across organization, with cost monitoring asset becoming standard reference for teams globally ● Collaborated across regions with Product Managers, Engineering, and customers - to enable complex use cases and scale solutions Tech Stack - Python, OCI Services, Kafka, SQL, Linux, Shell Scripting, Fusion Applications, APEX ● Wiley Edge/Morgan Stanley Data Engineer Intern/ Consultant March 2022 – Aug 2022 (6 months) ● Worked with Morgan Stanley’s Finance and Risk teams to enhance reporting and compliance workflows on the AXIOM regulatory reporting platform, ensuring accuracy and timeliness of submissions ● Designed and optimized (teamwork) ETL pipelines using Python and MySQL to process large volumes of financial data for downstream analytics and regulatory reporting Tech Stack - Python, MySQL, Axiom, AI/ML, Data Analytics ● Certifications ● Oracle Cloud Infrastructure 2025 Certified Generative AI Professional ● Oracle Cloud Infrastructure 2023 AI Certified Foundations Associate ● Oracle APEX Cloud Developer Certified Professional ● Oracle Cloud Infrastructure 2022 Observability and Management Certified Professional ● Oracle Cloud Data Management 2022 Foundations Certified Associate ● Oracle Machine Learning using Autonomous Database 2022 Certified Associate ● Oracle Cloud Infrastructure 2022 Certified Architect Associate ● Oracle Cloud Infrastructure 2022 Certified Foundations Associate"
  ],
  "education_raw": [
    "Guru Gobind Singh Indraprastha University B.Tech. in Computer Science and Engineering Aug 2018 - June 2022 CGPA: 8.75 / 10 Relevant Coursework: Object Oriented Programming, Database Management System, Data Structures and Algorithms, Operating Systems, Computer Networks, Machine Learning, Data Mining, System and Logic Design, etc. Achievements & Leadership ● Outstanding Rating FY25 and Employee of the Quarter (Q1 FY25) at Oracle - recognized for exceptional technical contribution and customer impact ● Gradhacks Project Winner 2024 (Oracle internal hackathon) - developed Health Camp Management Portal using Oracle APEX and AI/ML tools, demonstrating innovation in healthcare technology ● Madhacks Regional Finalist 2023 (Oracle internal hackathon) - competed at regional level (JAPAC) awareness programs ● Served as the Executive Lead of ACM USICT Club, organized learning sessions and competitions, fostering a vibrant tech community and mentoring junior members ● GATE Qualified 2021, 2022 ● Recommended by SSB Bhopal for Indian Army Officer position (2019) ● Recommended by 1 AFSB Dehradun for Indian Airforce Officer position (2019)"
  ],
  "skills": [
    "APEX",
    "AXIOM ● AI/ML: Oracle AI/ML Foundation",
    "Dashboards",
    "DBMS",
    "Fusion Applications",
    "GenAI",
    "Java",
    "Linux",
    "Management Agent",
    "MATLAB",
    "Microservices",
    "NumPy ● Languages: C/C++",
    "Object Storage",
    "OCI Connectors",
    "OCI Functions",
    "OCI Logging Analytics",
    "OCI Resource Manager",
    "OCI Streaming Service",
    "Pandas",
    "Python",
    "Shell Scripting ● Others: MySQL",
    "SIEM Tools",
    "SQL",
    "TensorFlow",
    "VBCS"
  ],
  "linkedin_url": "https://www.linkedin.com/in/munyatam-bhardwaj/",
  "experience_linkedin": [
    {
      "role": "data pipelines, and cost optimization dashboards for enterprise",
      "company": "customers. Passionate about scalable cloud solutions, customer",
      "period": "success, and continuous learning."
    },
    {
      "role": "Experience",
      "company": "Oracle",
      "period": "3 years 1 month"
    },
    {
      "role": "Cloud Solution Engineer - IC2",
      "company": "June 2025 - Present (4 months)",
      "period": "Bengaluru, Karnataka, India"
    },
    {
      "role": "Cloud Solution Engineer - IC1",
      "company": "September 2022 - May 2025 (2 years 9 months)",
      "period": "Bengaluru, Karnataka, India"
    },
    {
      "role": "Wiley Edge",
      "company": "Software Engineer",
      "period": "March 2022 - August 2022 (6 months)"
    },
    {
      "role": "India",
      "company": "Education",
      "period": "Guru Gobind Singh Indraprastha University"
    },
    {
      "role": "Page 1 of 2",
      "company": "Bachelor of Technology, Information Technology · (August 2018 - July 2022)",
      "period": "Montfort School, Delhi"
    },
    {
      "role": "· (June 2016 - March 2018)",
      "company": "Mohan Lal Dayal Vinay Mandir (Parle) School, Neemrana, Raj.",
      "period": "· (April 2012 - March 2016)"
    }
  ],
  "education_linkedin": [
    {
      "school": "Guru Gobind Singh Indraprastha University",
      "degree": "Page 1 of 2",
      "period": "Bachelor of Technology, Information Technology · (August 2018 - July 2022)"
    },
    {
      "school": "Montfort School, Delhi",
      "degree": "· (June 2016 - March 2018)",
      "period": "Mohan Lal Dayal Vinay Mandir (Parle) School, Neemrana, Raj."
    },
    {
      "school": "· (April 2012 - March 2016)",
      "degree": "Bright Day School, Vadodara, Guj.",
      "period": "· (April 2011 - March 2012)"
    },
    {
      "school": "Ambe School, Vadodara, Guj.",
      "degree": "· (April 2010 - March 2011)",
      "period": "Page 2 of 2"
    }
  ]
}